Documents/data-structures/binary-heap.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-11 Mon 20:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Binary Heap</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yao Xiao" />
<link rel="stylesheet" type="text/css" href="../../static/css/reset.css" />
<link rel="stylesheet" type="text/css" href="../../static/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Binary Heap</h1>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ffb86c;">#if</span><span style="color: #ffb86c;">n</span><span style="color: #ffb86c;">def</span> __BINHEAP_H_INCLUDED__
<span style="color: #ffb86c;">#define</span> <span style="color: #f8f8f2;">__BINHEAP_H_INCLUDED__</span>

<span style="color: #ffb86c;">#include</span> <span style="color: #f8f8f2;">&lt;</span><span style="color: #f1fa8c;">stdlib.h</span><span style="color: #f8f8f2;">&gt;</span>

<span style="color: #ffb86c;">#define</span> <span style="color: #f8f8f2;">T</span> <span style="color: #bd93f9;">int</span>

<span style="color: #ff79c6; font-weight: bold;">typedef</span> <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">(</span>*<span style="color: #bd93f9;">less_t</span><span style="color: #f8f8f2;">)(</span>T, T<span style="color: #f8f8f2;">)</span>;

<span style="color: #ff79c6; font-weight: bold;">struct</span> <span style="color: #bd93f9;">binheap_t</span> <span style="color: #f8f8f2;">{</span>
  <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">capacity</span>;
  <span style="color: #bd93f9;">less_t</span> <span style="color: #f8f8f2;">less</span>;
  <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">size</span>;
  <span style="color: #bd93f9;">T</span> * <span style="color: #f8f8f2;">data</span>;
<span style="color: #f8f8f2;">}</span>;
<span style="color: #ff79c6; font-weight: bold;">typedef</span> <span style="color: #ff79c6; font-weight: bold;">struct</span> <span style="color: #bd93f9;">binheap_t</span> * <span style="color: #bd93f9;">binheap_t</span>;

<span style="color: #bd93f9;">binheap_t</span> <span style="color: #50fa7b; font-weight: bold;">binheap_make</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">capacity</span>, <span style="color: #bd93f9;">less_t</span> <span style="color: #f8f8f2;">less</span><span style="color: #f8f8f2;">)</span> <span style="color: #f8f8f2;">{</span>
  <span style="color: #ff79c6; font-weight: bold;">struct</span> <span style="color: #bd93f9;">binheap_t</span> * <span style="color: #f8f8f2;">ptr</span> = malloc<span style="color: #8be9fd;">(</span><span style="color: #ff79c6; font-weight: bold;">sizeof</span><span style="color: #bd93f9;">(</span>*ptr<span style="color: #bd93f9;">)</span> + <span style="color: #ff79c6; font-weight: bold;">sizeof</span><span style="color: #bd93f9;">(</span>T<span style="color: #bd93f9;">)</span> * <span style="color: #bd93f9;">(</span>capacity + <span style="color: #8be9fd;">1</span><span style="color: #bd93f9;">)</span><span style="color: #8be9fd;">)</span>;
  ptr-&gt;capacity = capacity;
  ptr-&gt;less = less;
  ptr-&gt;size = <span style="color: #8be9fd;">0</span>;
  ptr-&gt;data = <span style="color: #8be9fd;">(</span><span style="color: #bd93f9;">T</span> *<span style="color: #8be9fd;">)</span> <span style="color: #8be9fd;">(</span>ptr + <span style="color: #8be9fd;">1</span><span style="color: #8be9fd;">)</span>;
  <span style="color: #ff79c6; font-weight: bold;">return</span> ptr;
<span style="color: #f8f8f2;">}</span>

<span style="color: #bd93f9;">void</span> <span style="color: #50fa7b; font-weight: bold;">binheap_free</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">binheap_t</span> * <span style="color: #f8f8f2;">ptr</span><span style="color: #f8f8f2;">)</span> <span style="color: #f8f8f2;">{</span>
  free<span style="color: #8be9fd;">(</span>*ptr<span style="color: #8be9fd;">)</span>;
  *ptr = <span style="color: #8be9fd;">NULL</span>;
<span style="color: #f8f8f2;">}</span>

<span style="color: #bd93f9;">void</span> <span style="color: #50fa7b; font-weight: bold;">binheap_swap</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">binheap_t</span> <span style="color: #f8f8f2;">binheap</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">i</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">j</span><span style="color: #f8f8f2;">)</span> <span style="color: #f8f8f2;">{</span>
  <span style="color: #bd93f9;">T</span> <span style="color: #f8f8f2;">temp</span> = binheap-&gt;data<span style="color: #8be9fd;">[</span>i<span style="color: #8be9fd;">]</span>;
  binheap-&gt;data<span style="color: #8be9fd;">[</span>i<span style="color: #8be9fd;">]</span> = binheap-&gt;data<span style="color: #8be9fd;">[</span>j<span style="color: #8be9fd;">]</span>;
  binheap-&gt;data<span style="color: #8be9fd;">[</span>j<span style="color: #8be9fd;">]</span> = temp;
<span style="color: #f8f8f2;">}</span>

<span style="color: #bd93f9;">void</span> <span style="color: #50fa7b; font-weight: bold;">binheap_shift_up</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">binheap_t</span> <span style="color: #f8f8f2;">binheap</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">index</span><span style="color: #f8f8f2;">)</span> <span style="color: #f8f8f2;">{</span>
  <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">parent</span>;
  <span style="color: #ff79c6; font-weight: bold;">for</span> <span style="color: #8be9fd;">(</span><span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">parent</span> = index / <span style="color: #8be9fd;">2</span>; parent &gt; <span style="color: #8be9fd;">0</span>; index = parent, parent /= <span style="color: #8be9fd;">2</span><span style="color: #8be9fd;">)</span> <span style="color: #8be9fd;">{</span>
    <span style="color: #ff79c6; font-weight: bold;">if</span> <span style="color: #bd93f9;">(</span>binheap-&gt;less<span style="color: #ff79c6;">(</span>binheap-&gt;data<span style="color: #ffb86c;">[</span>index<span style="color: #ffb86c;">]</span>, binheap-&gt;data<span style="color: #ffb86c;">[</span>parent<span style="color: #ffb86c;">]</span><span style="color: #ff79c6;">)</span><span style="color: #bd93f9;">)</span> <span style="color: #bd93f9;">{</span>
      binheap_swap<span style="color: #ff79c6;">(</span>binheap, index, parent<span style="color: #ff79c6;">)</span>;

    <span style="color: #bd93f9;">}</span> <span style="color: #ff79c6; font-weight: bold;">else</span> <span style="color: #bd93f9;">{</span>
      <span style="color: #ff79c6; font-weight: bold;">break</span>;
    <span style="color: #bd93f9;">}</span>
  <span style="color: #8be9fd;">}</span>
<span style="color: #f8f8f2;">}</span>

<span style="color: #bd93f9;">void</span> <span style="color: #50fa7b; font-weight: bold;">binheap_shift_down</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">binheap_t</span> <span style="color: #f8f8f2;">binheap</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">index</span><span style="color: #f8f8f2;">)</span> <span style="color: #f8f8f2;">{</span>
  <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">min</span>;
  <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">left</span>;
  <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">right</span>;
  <span style="color: #ff79c6; font-weight: bold;">while</span> <span style="color: #8be9fd;">(</span><span style="color: #8be9fd;">1</span><span style="color: #8be9fd;">)</span> <span style="color: #8be9fd;">{</span>
    min = index;
    left = index * <span style="color: #8be9fd;">2</span>;
    right = index * <span style="color: #8be9fd;">2</span> + <span style="color: #8be9fd;">1</span>;
    <span style="color: #ff79c6; font-weight: bold;">if</span> <span style="color: #bd93f9;">(</span>left &lt;= binheap-&gt;size &amp;&amp; binheap-&gt;less<span style="color: #ff79c6;">(</span>binheap-&gt;data<span style="color: #ffb86c;">[</span>left<span style="color: #ffb86c;">]</span>, binheap-&gt;data<span style="color: #ffb86c;">[</span>min<span style="color: #ffb86c;">]</span><span style="color: #ff79c6;">)</span><span style="color: #bd93f9;">)</span> <span style="color: #bd93f9;">{</span>
      min = left;
    <span style="color: #bd93f9;">}</span>
    <span style="color: #ff79c6; font-weight: bold;">if</span> <span style="color: #bd93f9;">(</span>right &lt;= binheap-&gt;size &amp;&amp; binheap-&gt;less<span style="color: #ff79c6;">(</span>binheap-&gt;data<span style="color: #ffb86c;">[</span>right<span style="color: #ffb86c;">]</span>, binheap-&gt;data<span style="color: #ffb86c;">[</span>min<span style="color: #ffb86c;">]</span><span style="color: #ff79c6;">)</span><span style="color: #bd93f9;">)</span> <span style="color: #bd93f9;">{</span>
      min = right;
    <span style="color: #bd93f9;">}</span>
    <span style="color: #ff79c6; font-weight: bold;">if</span> <span style="color: #bd93f9;">(</span>min != index<span style="color: #bd93f9;">)</span> <span style="color: #bd93f9;">{</span>
      binheap_swap<span style="color: #ff79c6;">(</span>binheap, min, index<span style="color: #ff79c6;">)</span>;
      index = min;

    <span style="color: #bd93f9;">}</span> <span style="color: #ff79c6; font-weight: bold;">else</span> <span style="color: #bd93f9;">{</span>
      <span style="color: #ff79c6; font-weight: bold;">break</span>;
    <span style="color: #bd93f9;">}</span>
  <span style="color: #8be9fd;">}</span>
<span style="color: #f8f8f2;">}</span>

<span style="color: #bd93f9;">void</span> <span style="color: #50fa7b; font-weight: bold;">binheap_push</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">binheap_t</span> <span style="color: #f8f8f2;">binheap</span>, <span style="color: #bd93f9;">T</span> <span style="color: #f8f8f2;">value</span><span style="color: #f8f8f2;">)</span> <span style="color: #f8f8f2;">{</span>
  binheap-&gt;data<span style="color: #8be9fd;">[</span>binheap-&gt;size++<span style="color: #8be9fd;">]</span> = value;
  binheap_shift_up<span style="color: #8be9fd;">(</span>binheap, binheap-&gt;size<span style="color: #8be9fd;">)</span>;
<span style="color: #f8f8f2;">}</span>

<span style="color: #bd93f9;">T</span> <span style="color: #50fa7b; font-weight: bold;">binheap_pop</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">binheap_t</span> <span style="color: #f8f8f2;">binheap</span><span style="color: #f8f8f2;">)</span> <span style="color: #f8f8f2;">{</span>
  <span style="color: #bd93f9;">T</span> <span style="color: #f8f8f2;">top</span> = binheap-&gt;data<span style="color: #8be9fd;">[</span><span style="color: #8be9fd;">1</span><span style="color: #8be9fd;">]</span>;
  binheap_swap<span style="color: #8be9fd;">(</span>binheap, <span style="color: #8be9fd;">1</span>, binheap-&gt;size<span style="color: #8be9fd;">)</span>;
  binheap-&gt;size--;
  binheap_shift_up<span style="color: #8be9fd;">(</span>binheap, binheap-&gt;size<span style="color: #8be9fd;">)</span>;
  <span style="color: #ff79c6; font-weight: bold;">return</span> top;
<span style="color: #f8f8f2;">}</span>

<span style="color: #bd93f9;">T</span> <span style="color: #50fa7b; font-weight: bold;">binheap_top</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">binheap_t</span> <span style="color: #f8f8f2;">binheap</span><span style="color: #f8f8f2;">)</span> <span style="color: #f8f8f2;">{</span>
  <span style="color: #ff79c6; font-weight: bold;">return</span> binheap-&gt;data<span style="color: #8be9fd;">[</span><span style="color: #8be9fd;">1</span><span style="color: #8be9fd;">]</span>;
<span style="color: #f8f8f2;">}</span>

<span style="color: #bd93f9;">T</span> <span style="color: #50fa7b; font-weight: bold;">binheap_size</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">binheap_t</span> <span style="color: #f8f8f2;">binheap</span><span style="color: #f8f8f2;">)</span> <span style="color: #f8f8f2;">{</span>
  <span style="color: #ff79c6; font-weight: bold;">return</span> binheap-&gt;size;
<span style="color: #f8f8f2;">}</span>

<span style="color: #bd93f9;">void</span> <span style="color: #50fa7b; font-weight: bold;">binheap_clear</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">binheap_t</span> <span style="color: #f8f8f2;">binheap</span><span style="color: #f8f8f2;">)</span> <span style="color: #f8f8f2;">{</span>
  binheap-&gt;size = <span style="color: #8be9fd;">0</span>;
<span style="color: #f8f8f2;">}</span>

<span style="color: #ffb86c;">#endif</span> <span style="color: #6272a4;">// </span><span style="color: #6272a4;">__BINHEAP_H_INCLUDED__</span>
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yao Xiao</p>
<p class="date">Created: 2019-03-11 Mon 20:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
